In [1]:
import pandas as pd

Q1. Create a Pandas Series that contains the following data: 4, 8, 15, 16, 23, and 42. Then, print the series.

In [6]:
a = [4, 8, 15, 16, 23,42]
df = pd.Series(a)

In [7]:
df

0     4
1     8
2    15
3    16
4    23
5    42
dtype: int64

dtype('int64')

Q2. Create a variable of list type containing 10 elements in it, and apply pandas.Series function on the
variable print it.

In [9]:
a = [1,2,3,4,5,6,7,8,9,0]
df1 = pd.Series(a)

In [10]:
df1

0    1
1    2
2    3
3    4
4    5
5    6
6    7
7    8
8    9
9    0
dtype: int64

Q3. Create a Pandas DataFrame that contains the following data:
    
    Name
Alice
Bob
Claire

Age
25
30
27

Gender
Female
Male
Female

Then, print the DataFrame.

In [13]:
data = { "Name":["Alice","Bob","Claire"],
        "Age":[25,30,27],
        "Gender":["Female","Male","Female"]}

In [14]:
df3 = pd.DataFrame(data)

In [15]:
df3

     Name  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  Claire   27  Female

Q4. What is ‘DataFrame’ in pandas and how is it different from pandas.series? Explain with an example.

In pandas, a DataFrame is a two-dimensional labeled data structure that can hold data of different types (e.g., numeric, string, boolean, etc.) in a tabular format, similar to a spreadsheet or a SQL table. It is one of the most commonly used data structures in pandas and provides a powerful and flexible way to manipulate and analyze data.

A DataFrame consists of rows and columns, where each column can be thought of as a Series. In other words, a DataFrame is a collection of Series objects that share the same index. Unlike a Series, which represents a single column of data, a DataFrame allows you to work with multiple columns simultaneously.

In [16]:
#series
import pandas as pd
series = pd.Series([4, 8, 15, 16, 23, 42])
print(series)

0     4
1     8
2    15
3    16
4    23
5    42
dtype: int64

In [17]:
#Dataframe
data = {'A': [4, 8, 15, 16, 23, 42], 'B': ['apple', 'banana', 'cherry', 'date', 'elderberry', 'fig']}
df = pd.DataFrame(data)
print(df)

    A           B
0   4       apple
1   8      banana
2  15      cherry
3  16        date
4  23  elderberry
5  42         fig

Q5. What are some common functions you can use to manipulate data in a Pandas DataFrame? Can
you give an example of when you might use one of these functions?

Pandas provides a wide range of functions to manipulate data in a DataFrame. Here are some common functions you can use:

head(): Returns the first n rows of the DataFrame. It is useful to quickly inspect the structure and contents of the DataFrame.

In [18]:
df1.head()

0    1
1    2
2    3
3    4
4    5
dtype: int64

tail(): Returns the last n rows of the DataFrame. It is useful to check the end of the DataFrame.

In [19]:
df1.tail()

5    6
6    7
7    8
8    9
9    0
dtype: int64

info(): Provides a concise summary of the DataFrame, including the data types, non-null values, and memory usage. It is useful for initial data exploration and identifying missing values.

In [21]:
df3.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    3 non-null      object
 1   Age     3 non-null      int64
 2   Gender  3 non-null      object
dtypes: int64(1), object(2)
memory usage: 200.0+ bytes

describe(): Generates descriptive statistics of the DataFrame, such as count, mean, min, max, and quartiles, for each numerical column. It provides an overview of the distribution of the data.

In [23]:
df3.describe()

             Age
count   3.000000
mean   27.333333
std     2.516611
min    25.000000
25%    26.000000
50%    27.000000
75%    28.500000
max    30.000000

shape: Returns a tuple representing the dimensions (rows, columns) of the DataFrame.

In [25]:
df3.shape

(3, 3)

loc[]: Accesses rows and columns by label(s) or a boolean array.

In [34]:
df3.loc[0:2,"Name":"Age"]

     Name  Age
0   Alice   25
1     Bob   30
2  Claire   27

iloc[]: Accesses rows and columns by integer position(s).

In [29]:
df3.iloc[0:2]

    Name  Age  Gender
0  Alice   25  Female
1    Bob   30    Male

fillna(): Fills missing values in the DataFrame.

drop(): Drops specified rows or columns from the DataFrame.

groupby(): Groups the DataFrame by one or more columns and performs aggregations or transformations.

Q6. Which of the following is mutable in nature Series, DataFrame, Panel?

Among the options mentioned, the DataFrame is mutable in nature.

In pandas, a DataFrame is a mutable data structure, which means that you can modify its content after it has been created. You can change values, add or remove rows or columns, apply transformations, and perform various manipulations on the DataFrame.

On the other hand, both the Series and Panel data structures are immutable. Once created, you cannot modify their content directly. If you need to make changes, you typically create a new Series or Panel with the desired modifications.

Note that the Panel data structure has been deprecated in recent versions of pandas and is no longer recommended for general use. The primary data structure in pandas is the DataFrame, which is widely used for data manipulation and analysis.

Q7. Create a DataFrame using multiple Series. Explain with an example.

In [35]:
import pandas as pd

# Creating Series
name = pd.Series(['Alice', 'Bob', 'Charlie'])
age = pd.Series([25, 30, 35])
city = pd.Series(['New York', 'London', 'Tokyo'])

# Creating DataFrame using Series
data = {'Name': name, 'Age': age, 'City': city}
df = pd.DataFrame(data)

# Printing the DataFrame
print(df)

      Name  Age      City
0    Alice   25  New York
1      Bob   30    London
2  Charlie   35     Tokyo